Repository: g34r/OpenTyping
Catalog: OpenTyping/Resources/Lang/LangStr.*.resx
Languages: ru, uz

source: Add
ru: Добавить
uz: Qo'shish

# AppDesc
source: OpenSource Mordern Keyboard Typing Trainer
ru: Тренажер современной клавиатуры с открытым исходным кодом
uz: Ochiq manbali zamonaviy klaviatura mashq dasturi

# AppName
source: OpenTyping
ru: Быстрый набор
uz: TezTer

# ArtPrac
source: Long sentences
ru: Упражнения текстов
uz: Matnlar mashqi

# ArtPracDesc
source: Practice with one long sentence
ru: Практикуйте через один текст.
uz: Bir matn orqali mashq qiling.

# AvgSpeed
source: Average speed
ru: Средняя скорость набора
uz: O'rtacha terish tezligi

# CurKeyboard
source: Current Keyboard
ru: Текущая клавиатура
uz: Joriy klaviatura

# CurPracData
source: Current sentences
ru: Текущие тексты
uz: Joriy matnlar

source: Delete
ru: Удалить
uz: O'chirish

# ErrMsg1
source: Please select 2 or more keys to practice
ru: Пожалуйста, выберите 2 или более ключей для тренировки.
uz: Iltimos, mashq qilish uchun 2 yoki undan ortiq kalitni tanlang.

# ErrMsg10
source: Duplicate names exist
ru: Существуют повторяющиеся имена.
uz: Takroriy nomlar mavjud.

# ErrMsg11
source: No Name field.
ru: Нет площади Name.
uz: Name maydoni yo'q.

# ErrMsg12
source: No KeyLayoutData field.
ru: Нет площади KeyLayoutData.
uz: KeyLayoutData maydoni yo'q.

# ErrMsg13
source: No Character field.
ru: Нет площади Chracter.
uz: Chracter maydoni yo'q.

# ErrMsg14
source: TextData field size is 0.
ru: Размер поля TextData равен 0.
uz: TextData maydoni hajmi 0 ga teng.

# ErrMsg15
source: Doesn't exist TextData field.
ru: Нет площади TextData.
uz: TextData maydoni yo'q.

# ErrMsg16
source: Column of numbers
ru: Строка чисел
uz: Raqamlar qator

# ErrMsg17
source: First row
ru: Первая строка
uz: Birinchi qator

# ErrMsg18
source: Second row
ru: Вторая строка
uz: Ikkinchi qator

# ErrMsg19
source: Third row
ru: Третья строка
uz: Uchinchi qator

# ErrMsg2
source: A file with the same name already exists in the Keyboard data path.
ru: Файл с таким названием уже существует в разделе «Файлы клавиатуры».
uz: Shu nomdagi fayl Klaviatura fayllari papkasida allaqachon mavjud.

# ErrMsg20
source: Number of key is
ru: количество ключей в
uz: ning kalit jami

# ErrMsg21
source: need, but
ru: нужно, но
uz: ta kerak, lekin

# ErrMsg22
source: does not match
ru: не соответсвует
uz: ta borligidan mos kelmaydi.

# ErrMsg3
source: A file with the same name already exists in the practice data path.
ru: Файл с таким именем уже существует в разделе Текстовые файлы.
uz: Shu nomdagi fayl Matnlar fayllari papkasida allaqachon mavjud.

# ErrMsg4
source: Cannot be deleted because only one keyboard data exists.
ru: Нельзя удалить, так как существует информация только об одной клавиатуре.
uz: O'chirib bo'lmaydi, chunki faqat bitta klaviatura ma'lumotlari mavjud.

# ErrMsg5
source: Cannot be deleted because only one practice data exists.
ru: Нельзя удалить, потому что есть только одна текстовая информация.
uz: O'chirib bo'lmaydi, chunki faqat bitta matn ma'lumotlari mavjud.

# ErrMsg6
source: The number of Hangul syllables in the file is one or less.
ru: Количество корейских слогов в файле — одна или меньше.
uz: Fayldagi koreyscha bo'g'inlari soni bitta yoki undan kam.

# ErrMsg7
source: An error occurred while locating the application path.
ru: Произошла ошибка при определении ориентации файла приложения.
uz: Ilova fayl papkasini aniqlashda xatolik yuz berdi.

# ErrMsg8
source: Cannot find keyborad data file. Please create keyboard data in that path and try again.
ru: Не удалось найти файл клавиатуры. Создайте файл клавиатуры в этом направлении и повторите попытку.
uz: Klaviatura faylini topib bo'lmadi. Klaviatura faylini o'sha papkasida yarating va qayta urinib ko'ring.

# ErrMsg9
source: Cannot fidn practice data file. Please create practice data in that path and try again.
ru: Не удалось найти файл текста.Создайте текстовый файл в этом направлении и повторите попытку.
uz: Matn faylini topib bo'lmadi. Matn faylini o'sha papkasida yarating va qayta urinib ko'ring.

# ExceptShftKey
source: Excluding upper key(Shift)
ru: Данный клавиш (Shift) исключается
uz: Katta harflar

source: Home
ru: Основной
uz: Asosiy

# InfoMsg1
source: Select practice data you want to practice.
ru: Выберите текст, который вы хотите тренировать.
uz: Mashq qilmoqchi bo'lgan matnini tanlang.

# InitStatInfo
source: Reset statistic information
ru: Переустановка Статистики
uz: Statistik ma'lumotlarni qayta o'rnatish

# InPage
source: of pages
ru: страниц
uz: sahifalarning

# KeyDataFile
source: Keyboard File data
ru: файлы клавиатуры
uz: Klaviatura fayllari

# KeyDataOpen
source: Open Keyboard File
ru: Открыть файл клавиатуры
uz: Klaviatura fayli ochish

# KeyDataPath
source: Keyboard layout path
ru: Направление файлов клавиатуры
uz: Klaviatura fayllar papkasi

# KeyPrac
source: Keys
ru: Упражнение букв
uz: Harflar mashqi

# KeyPracDesc
source: Practice the position of each key on the keyboard.
ru: Практикуйте расположение каждой клавиши на клавиатуре.
uz: Klaviaturadagi har bir tugmachalarning joyini mashq qiling.

# KeyPracHelp
source: Click the position of the key you want to practice on/off.
ru: Чтобы включить / выключить нажмите клавишу, которую вы хотите потренировать.
uz: Har tugmacha o'rnini bosib mashq qilmoqchi tugmachani tanlash mumkin.

# MostWrongKey
source: Most mistyped key
ru: Часто ошибающаяся буква
uz: Ko'p xatoga yo'l qo'ygan harflaringiz

# NumPracSen
source: Number of sentence practiced
ru: Количество практикованных предложений
uz: Amaldagi gaplar soni

# PracDataFile
source: Practice Data File
ru: Текстовые файлы
uz: Matn fayllari

# PracDataPath
source: Sentences path
ru: Направление текстовых файлов
uz: Matn fayllar papkasi

# RanSenLoc
source: Random arrangement of sentences
ru: Случайное расположение предложений
uz: Gaplarni tasodifiy tartibga solish

# SenPrac
source: Sentences
ru: Упражнение предложений
uz: Gaplar mashqi

# SenPracDesc
source: Practice by dividing it into short sentences
ru: Тренируйтесь, разделив текст на короткие предложения.
uz: Matnni qisqa qismlarga bo'lib mashq qiling.

# SenPracHelp
source: Select the sentence you want to practice by clicking on it.
ru: Нажмите на текст, который хотите упражняться
uz: Mashq qilmoqchi bo'lgan matnni tanlab, ustiga bosing

# SetKeyboard
source: Keyboard layout
ru: Тип клавиатуры
uz: Klaviatura turi

# SetPracData
source: Sentences
ru: Тексты
uz: Matnlar

# SetProgramLang
source: Language
ru: Язык
uz: Til

source: Setting
ru: Настройки
uz: Sozlash

source: Speed
ru: Скорость набора
uz: Terish tezligi

# StartPrac
source: Start practice
ru: Начать упражнение
uz: Mashqni boshlash

# SylPrac
source: Syllables
ru: Упражнение слог
uz: Bo'g'inlar mashqi

# SylPracDesc
source: Practice by entering syllable units (Korean only)
ru: Практикуйтесь, добавляя по слогам (только на корейском языке)
uz: Bo'g'in birliklarini kiritish orqali mashq qiling (Faqat koreyscha)

# SylPracHelp
source: 2350 characters are practiced with the most frequently used in modern Hangul
ru: Практикуемые 2350 слогов, наиболее широко используются в современном корейском языке.
uz: Mashq qilinadigan 2350 ta bo'g'inlar hozirgi koreyschada eng ko'p qo'llaniladiganlardir.

# WarnMsg1
source: Selected keyboard data
ru: Выбранная клавиатура
uz: Tanlangan klaviatura

# WarnMsg2
source: Selected practice data
ru: Выбранный текст
uz: Tanlangan matn

# WarnMsg3
source: Are you sure you want to delete?
ru: Вы хотите удалить это
uz: ni o'chirib tashlamoqchimisiz?

# WarnMsg4
source: Are you sure you want to delete statistical information?
ru: ning statistik maʼlumotlarni oʻchirib tashlamoqchimisiz?
uz: ning statistik ma'lumotlarni qayta tiklamoqchimisiz?

# ErrMsg23
source: Forth row
ru: Четвёртая строка
uz: To'rtinchi qator

# Char11722
source: 11172 Charaters
ru: 11172 слогов
uz: 11172 bo'g'inlar

# Char2350
source: 2350 Characters
ru: 2350 слогов
uz: 2350 bo'g'inlar

# FinishedPrac
source: Practice is finished.
ru: Упражнение окончено.
uz: Mashq tugadi.

# LastSpeed
source: Your last speed:
ru: Ваша последняя скорость
uz: Sizning oxirgi tezligingiz

source: User defined
ru: Пользователи
uz: Foydalanuvchi aniqlagan
